EDT.СЭ_Доработки/src/Catalogs/ОбразованиеФизическихЛиц/ОбразованиеФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="93b30f47-6b97-47f5-a24b-4a1707ae9919">
  <name>ОбразованиеФизическихЛиц</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b9d6aae2-2811-4814-9cff-1f88c42e8a06">
    <name>СЭ_МолодойСпециалист</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f499ad5d-4a2e-45b8-9340-50d0a8685403">
    <name>СЭ_ДатаНачалаСтатуса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6264e436-676e-4f08-a00e-a6cd92e48c0e">
    <name>СЭ_ДатаОкончанияСтатуса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

EDT.СЭ_Доработки/src/Catalogs/ОбразованиеФизическихЛиц/ObjectModule.bsl
&После("ОбработкаПроверкиЗаполнения")
Процедура СЭ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	//СЭ+ Евгений [16498]
	Если НЕ СЭ_МолодойСпециалист Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СЭ_ДатаНачалаСтатуса");
		МассивНепроверяемыхРеквизитов.Добавить("СЭ_ДатаОкончанияСтатуса");
	КонецЕсли;
	//СЭ- Евгений [16498]
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры


&После("ПередЗаписью")
Процедура СЭ_ПередЗаписью(Отказ)
	
	//Перепроверяем что только одно высшее образование в котором признак молодого специалиста
	Если СЭ_МолодойСпециалист Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =  
			"ВЫБРАТЬ
			|	ОбразованиеФизическихЛиц.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ОбразованиеФизическихЛиц КАК ОбразованиеФизическихЛиц
			|ГДЕ
			|	ОбразованиеФизическихЛиц.Владелец = &Владелец
			|	И ОбразованиеФизическихЛиц.ПометкаУдаления = ЛОЖЬ
			|	И ОбразованиеФизическихЛиц.Ссылка <> &Ссылка
			|	И ОбразованиеФизическихЛиц.СЭ_МолодойСпециалист = ИСТИНА";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТекстОшибки = "Уже есть образование с признаком ""Молодой специалист"", может быть только одно образование с включенным признаком.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
